/*************************************
              今明电子
凡在本店购买满30元，下次购买即可返还5角；
      满50元，下次购买即可返还1元；
     满100元，下次购买即可返还2元；
     满150元，下次购买即可返还4元；
      满200元，下次购买即可免邮
http://shop106001793.taobao.com/search.htm?spm=a1z10.5.w5002-3375901029.1.l1TXSl&search=y
              stm8s105
               V1.1
             2013.9.8
**************************************/

#include "led.h"
#include "ALL_Includes.h"

/***********************
函数功能：初始化LED
输入参数：无
输出参数：无
备    注：无
***********************/
void LED_Init(void)
{
      //设置IO口为输出
    LEDPort->DDR |= LEDPin;//输出模式
    LEDPort->CR1 |= LEDPin;//推挽输出 
}

/***********************
函数功能：LED开
输入参数：无
输出参数：无
备    注：无
***********************/
void LED_ON(void)
{
    LEDPort->ODR &=~LEDPin;//LED置低
}

/***********************
函数功能：LED开
输入参数：无
输出参数：无
备    注：无
***********************/
void LED_OFF(void)
{
    LEDPort->ODR |= LEDPin;//LED置高
}