/*************************************
              今明电子
凡在本店购买满30元，下次购买即可返还5角；
      满50元，下次购买即可返还1元；
     满100元，下次购买即可返还2元；
     满150元，下次购买即可返还4元；
      满200元，下次购买即可免邮
http://shop106001793.taobao.com/search.htm?spm=a1z10.5.w5002-3375901029.1.l1TXSl&search=y
              stm8s105
               V1.1
             2013.9.8
**************************************/

#include "ALL_Includes.h"
#include "Time.h"

/***********************
函数功能：TIM4定时中断初始化
输入参数：无
输出参数：无
备    注：100us定时中断一次
***********************/
void Time_Init(void)
{   
    /***********************************
    定时器时钟TIM_CLK = CPU_CLK / PSCR = 1MHZ
    溢出频率 = TIM_CLK / (ARR + 1) = 10KHZ
    ***********************************/
    TIM4->PSCR  = 0x04;//计数器16分频 2的N次方分频 
    TIM4->ARR   = 99;//自动装载寄存器
    TIM4->IER  |= BIT(0);//更新中断请求
    
    TIM4->CR1 |= BIT(0);//使能计数器
    
    rim();//开总中断
}